Tekla.Structures.ModelInternal.dotClipPlane_t
View ClipPlane struct

Tekla.Structures.ModelInternal.dotClipPlane_t.ID
Clipplane ID

Tekla.Structures.ModelInternal.dotClipPlane_t.Location
Clipplane location in global coordinates (XYZ)

Tekla.Structures.ModelInternal.dotClipPlane_t.UpVector
Clipplane up vector (Roll)

Tekla.Structures.ModelInternal.dotClipPlane_t.IsBorderVisible
Clipplane border visibility

Tekla.Structures.ModelInternal.dotClipPlane_t.IsScissorVisible
Clipplane scissor icon visibility